Documents/Тестирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>Тестирование</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РезультатТестирования</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Студент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Группы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатТестирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Темы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Студенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Студенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ИмпортДанных/Ext/Module.bsl
#Область ИмпортСтуденты  

 &НаСервере
Функция ПолучитьФИ (ФамилияСтудента, ИмяСтудента) Экспорт
	Имя     = ИмяСтудента;
	Фамилия = ФамилияСтудента;  
	
	ПерБкИмени = Лев(Имя,1);		
	Студент = ПерБкИмени + ". " + Фамилия; 
	
	Возврат Студент;
КонецФункции	

Процедура СоздатьГруппуСтудента(НаимнованиеГруппы) Экспорт
	НаименованиеГруппСтудента = Справочники.Студенты.НайтиПоНаименованию(НаимнованиеГруппы,Истина);
	Если НЕ ЗначениеЗаполнено(НаименованиеГруппСтудента)  Тогда	
		Группы = Справочники.Студенты.СоздатьГруппу();
		Группы.Наименование = НаимнованиеГруппы;	
		Группы.Записать();	        
		Сообщить("Группа " + НаимнованиеГруппы + "  создана справочнике 'Студенты'"); 
	Иначе 
		Сообщить("Группа не создана! Группа " + НаимнованиеГруппы + " уже есть справочнике 'Студенты'");
	КонецЕсли;
КонецПроцедуры

Процедура СоздатьГруппуСправочник(НаимнованиеГруппы) Экспорт
	НаименованиеГруппыСправочника = Справочники.Группы.НайтиПоНаименованию(НаимнованиеГруппы,Истина);
	Если Не ЗначениеЗаполнено(НаименованиеГруппыСправочника) тогда 
		ГруппаСправочник = Справочники.Группы.СоздатьГруппу();
		ГруппаСправочник.Наименование = НаимнованиеГруппы;
		ГруппаСправочник.Записать(); 
		Сообщить("Группа " + НаимнованиеГруппы + "  создана справочнике 'Группы'"); 
	Иначе 
		Сообщить("Группа не создана! Группа " + НаимнованиеГруппы + " уже есть справочнике 'Группы'"); 
	КонецЕсли
КонецПроцедуры


&НаСервере
Процедура ИмпортГруппНаСервере(ПутьКФалу) Экспорт
   	Файл = Новый ТекстовыйДокумент;
	Файл.Прочитать(ПутьКФалу);	
	Для Стр = 2 По  Файл.КоличествоСтрок() Цикл
		ТекСтрока = Файл.ПолучитьСтроку(Стр);  
		
		СоздатьГруппуСтудента(ТекСтрока);
		СоздатьГруппуСправочник(ТекСтрока);
				
	КонецЦикла;
КонецПроцедуры
&НаСервере
Процедура ИмпортСтудентовНаСервере(ПутьКФалу) Экспорт
	Файл = Новый ТекстовыйДокумент;
	Файл.Прочитать(ПутьКФалу);
	
	Для Стр = 2 По  Файл.КоличествоСтрок() Цикл
		ТекСтрока = Файл.ПолучитьСтроку(Стр);
		МассСтр =  СтрРазделить(ТекСтрока,";",Истина); 
		
		Студенты = Справочники.Студенты.СоздатьЭлемент();
		Студенты.Наименование = ПолучитьФИ(МассСтр[0],МассСтр[1]);
		Студенты.Имя  	           	= МассСтр[1];
		Студенты.Фамилия 	  = МассСтр[0]; 
		
		//Если в спр Студенты нет группы
       		Если НЕ ЗначениеЗаполнено(Справочники.Студенты.НайтиПоНаименованию(МассСтр[2],Истина)) Тогда
			СоздатьГруппуСтудента(МассСтр[2]);
			Студенты.Родитель  = Справочники.Студенты.НайтиПоНаименованию(МассСтр[2],Истина);
		Иначе 
			Студенты.Родитель  = Справочники.Студенты.НайтиПоНаименованию(МассСтр[2],Истина);
		КонецЕсли; 
		
		//Если в спр Группы нет группы
		Если  НЕ ЗначениеЗаполнено(Справочники.Группы.НайтиПоНаименованию(МассСтр[2],Истина)) Тогда	
			СоздатьГруппуСправочник(МассСтр[2]);	
		КонецЕсли;
	
		Студенты.Записать();	
	КонецЦикла;
КонецПроцедуры  

#КонецОбласти


&НаСервере
Процедура ИмпортТестированиеНаСервере(Файл) Экспорт
	
	Чтение = Новый ЧтениеТекста(Файл,КодировкаТекста.ANSI);
	
	Текст = Чтение.Прочитать();
	
	Для Сч = 2 по СтрЧислоСтрок(Текст) Цикл 
		Строка 		= СтрПолучитьСтроку(Текст,Сч);
		РаздСтр 	= СтрРазделить(Строка,";");
		
		Документ = Документы.Тестирование.СоздатьДокумент();
		
		Документ.Студент 		= Справочники.Студенты.НайтиПоНаименованию(РаздСтр[0], Истина);
		
		
		Если  НЕ ЗначениеЗаполнено(Справочники.Группы.НайтиПоНаименованию(РаздСтр[1],Истина)) Тогда	
			Справочник = Справочники.Группы.СоздатьЭлемент();
			Справочник.Наименование = РаздСтр[1];
			Справочник.Записать();
			Документ.Группа		= Справочники.Группы.НайтиПоНаименованию(РаздСтр[1],Истина);
			Сообщить("Группа '" + РаздСтр[1] + "' создана!"); 
		Иначе 
			Документ.Группа		= Справочники.Группы.НайтиПоНаименованию(РаздСтр[1],Истина);
		КонецЕсли;
		
		
		
		
		Если  НЕ ЗначениеЗаполнено(Справочники.Темы.НайтиПоНаименованию(РаздСтр[2],Истина)) Тогда	
			Справочник = Справочники.Темы.СоздатьЭлемент();
			Справочник.Наименование = РаздСтр[2];
			Справочник.Записать();
			Документ.Тема = Справочники.Темы.НайтиПоНаименованию(РаздСтр[2],Истина);
			Сообщить("Тема '" + РаздСтр[2] + "' создана!"); 
		Иначе 
			Документ.Тема = Справочники.Темы.НайтиПоНаименованию(РаздСтр[2],Истина);
		КонецЕсли;
		
		Документ.РезультатТестирования = РаздСтр[3];
		Документ.Дата			= РаздСтр[4];
		Документ.Проведен   	= РаздСтр[5];
		
		Документ.Записать(РежимЗаписиДокумента.Проведение);	
	КонецЦикла;
	
КонецПроцедуры



&НаСервере
Процедура ИмпортТемНаСервере(ПутьКФайлу) Экспорт
	Файл 	= Новый ЧтениеТекста(ПутьКФайлу);
	Текст 	= Файл.Прочитать();
	
	Для Сч = 2 По СтрЧислоСтрок(Текст) Цикл
		Строка = СтрПолучитьСтроку(Текст,Сч);
		
		Если НЕ ЗначениеЗаполнено(Справочники.Темы.НайтиПоНаименованию(Строка,Истина)) Тогда
			Справочник = Справочники.Темы.СоздатьЭлемент();
			Справочник.Наименование = Строка;
			Справочник.Записать();
			Сообщить("Тема '" + Строка + "' создана!"); 
		Иначе 	
			Сообщить("Не создана тема '" + Строка + "' так как уже создана!");		
		КонецЕсли;
		
	КонецЦикла;	            
	
КонецПроцедуры
